//Напишете функция area() без параметри. Поискайте от
//потребителя да въведе радиуса с помощта на функциите :
//printf("Enter a radius\n");
//scanf("%lf", &r);
//Използвайте горната функция 1.за изчисляване на площта на кръг, която
//написахме преди малко за да изчислите площта на кръга с този радиус и
//върнете резултата:
//

#include<stdio.h>

float area()
{
    float pi = 3.14 ;
    float r ;
    printf("Enter radius : \n");
    scanf("%f" , &r);
    return r * r * pi ;
}

int main()
{
   printf("%.2f" , area());
}
