/* Задача 5. Дефинирайте потребителски тип към масив. Инициализирайте
масива, изведете на конзолата. */

typedef int array[10] ; 

#include<stdio.h>

int main()
{
    array list = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10} ;
    printf("%d" , list[5]) ; 

}