/* Задача 11. Напишете функциите като макроси:
1. Функция AVG(x, y), която смята средното аритметично на две подадени
като параметър числа.
2. Функция AVG, която смята средното аритметично на числата от
определен диапазон.
3. Напишете функцията повдигане на степен, която повдига х на степен у
4. Напишете функцията TOUPPER, която прави малката буква а в голяма А
5. Напишете функцията DISP((f), (x)), която показва резултата от функции
връщащи double като корен квадратен. DISP(sqrt, 3.0)
 Макрото трябва да се експандне до printf(“sqrt (%g) = %g\n”, 3.0, sqrt(3.0)); */

 #include<stdio.h>

 #define AVG(X,Y) (X+Y)/2
 #define AVG1(X ,Y, S) ({for (; X < Y ; X++){ S += X} return S})

 int main()
 {
    int t = AVG(5 ,11);
    printf("%d\n", t); 
    printf("%d" , AVG1(1, 5 ,0));
 }