/*   Задача 8*. Напишете програма, която пресмята колко символа има в един
низ преди края на низа, обозначен със символа ‘\0’.
 */


#include<stdio.h>

int main()
{
    char str[] = "HI";
    int i = 0 ;
    while (str[i] != '\0')
    {
        printf("%c" , str[i]);

        i++ ;
    }
    printf("\n%d" , i );
}
