//Напишете програма на С, която съдържа 3 функции, изнесете
//прототипите им в отделен .h файл.
//1. Първата функция да калкулира най-малко общо кратно на две положителни
//числа.
//2. Втората функция връща абсолютна стойност на числата (положителната
//стойност на числата).
//a. Трябва да може да приеме като параметър float и да върне float.
//b. Тествайте с инт и float.
//3. Напишете функция, която калкулира корен квадратен от число.
//a. Проверете дали резултатът е отрицателно число и върнете -1.
//b. Използвайте втората си функция, за да обърнете числото в положително и да
//намерите корен квадратен от него.


#include<stdio.h>
#include "f.h"

int main()
{

    int n = 2;
    int m = 3;

    printf("%d\n", nok(n ,m));
    printf("%f", absoluteDigit(-5));
}

int nok(int a , int b)
{
    int result ;
    for(int i = 1 ; ; i++)
    {
        if(i % a == 0 && i % b == 0)
        {
            result = i ;
            break;
        }
    }
    return result;
}

float absoluteDigit(float a )
{
    if(a < 0)
    {
       a = a * -1 ;
    }
    return a ;
}
