/* Задача 7. Реализирайте масив с променлива размерност. Началният размер на
масива да бъде въведен от потребителя. Запълнете масива с избрани от вас цели
числа. Изведете масива на екрана. Запитайте потребителя за нов размер на
масива и повторете предните операции - запълнете масива с избрани от вас числа и го изведете на екрана. */

#include<stdio.h>
#include<stdlib.h>

void print (int *p)
{
    for (size_t i = 0; i < 30; i++)
    {
        *p = i ;
        printf("%d ", *p);
        p++ ;
    }
    
    
}

int main()
{
    int arr [20] ;
    
    int *ptr ;

    ptr = (int*) malloc (20 * sizeof(int));
    ptr = (int*) realloc(ptr , 30 * sizeof(int));

    print(ptr); 

    printf("\n\n%d" , *ptr); 


}
