/* Задача 1. Напишете функция, която печата низ, като принтирате всеки
символ поотделно. Указателя към началото му е подаден като аргумент на
функцията void printstr(char *s); Не забравяйте, низът винаги
завършва с знак за терминираща нула '\0', затова проверката в цикъла, който
принтира всеки символ, трябва да е докато не се стигне този знак. */

#include<stdio.h>

void prntStr(char *ptr )
{
    
    if (*ptr == '\0')
    {
        printf("\n");
        return ; 
    }
    printf("%c" , *ptr); 
    prntStr(ptr + 1);
    
}
int main()
{
    char str[]= "this is string";
    prntStr(str);
}