//напишете програма която при даден масив с числа да принти нов масив който да съдържа на даден индекс всички числа умножени без числото на дадения индекс
//
//Например ако имаме масива [5, 1, 4, 2]
//трябва да направите нов масив с който да съдържа числата [8, 40, 10, 20]

// 8 = 1 * 4 * 2
// 40 = 5 * 4 * 2
// 10 = 5 * 1 *2
// 20 = 5 * 1 * 4

#include <stdio.h>

int main()
{

int arrNums[] = {5 , 1 , 4 , 2};
int arrTemp[4] ;
int i , j ;
int multiply = 1 ;

    for(i = 0 ; i < 4 ; i++)
    {
        for(j = 0 ; j < 4 ; j++)
        {
            if(i != j)
            {
                multiply *= arrNums[j];
                arrTemp[i] = multiply;
            }
        }

        multiply = 1 ;
    }

    for(i = 0 ; i < 4 ; i++)
    {
        printf("%d " , arrTemp[i]);
    }
}

